Revit 2026 API

# WireMaterialTypeSetContains Method

---

Tests for the existence of a wire material type within the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Contains(
	WireMaterialType item
)
```
```vb
Public Overridable Function Contains (
	item As WireMaterialType
) As Boolean
```
```cpp
public:
virtual bool Contains(
	WireMaterialType^ item
)
```
```fsharp
abstract Contains :
        item : WireMaterialType -> bool
override Contains :
        item : WireMaterialType -> bool
```

#### Parameters

item WireMaterialType
    The wire material type to be searched for.

#### Return Value

BooleanThe Contains method returns True if the wire material type is within the set, otherwise False.

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace